Интенсивное_обучение_программированию/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбразованиеСотрудника</name>
    <attributes>
      <name>Специальность</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаОбучения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияОбучения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Интенсивное_обучение_программированию/src/Catalogs/Сотрудники/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	ОбновитьФИО();	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьФИО()
		
	Если НЕ (ЗначениеЗаполнено(Объект.Фамилия) 
		ИЛИ ЗначениеЗаполнено(Объект.Имя) 
		ИЛИ ЗначениеЗаполнено(Объект.Отчество)) Тогда 
		Возврат;
	КонецЕсли; 
	
	Обработчик = Новый ОписаниеОповещения("Подключаемый_ОбновитьФИОЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Обработчик,"Обновить данные ФИО?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да );	

КонецПроцедуры

&НаКлиенте	
Процедура Подключаемый_ОбновитьФИОЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Модифицированность = Ложь;
		ЭтотОбъект.ЭтаФорма.Закрыть();
		Возврат;
	КонецЕсли;	
		
	Массив = СтрРазделить(Строка(Объект.Наименование)," ",Ложь);
	Объект.Фамилия = Массив[0];
	Объект.Имя = Массив[1];
	Объект.Отчество = Массив[2];
	
КонецПроцедуры

#КонецОбласти
